[
  {
    "content": "العلوم في الحضارة الإسلامية العلوم في الحضارة الإسلامية لقد ازدهرت العلوم في الحضارة الإسلامية بشكل مذهل خلال العصور الوسطى. وقد ساهم العلماء المسلمون في تطوير العديد من المجالات العلمية مثل الطب والرياضيات والفلك والكيمياء. الطب الإسلامي برز في الطب الإسلامي أطباء عظماء مثل ابن سينا والرازي وابن النفيس. لقد وضع ابن سينا كتاب القانون في الطب الذي ظل مرجعاً أساسياً في أوروبا لعدة قرون. الرياضيات في مجال الرياضيات، طور العلماء المسلمون علم الجبر وأسسوا قواعد الخوارزميات. الخوارزمي هو من أعطى اسمه لكلمة \"خوارزمية\" المستخدمة اليوم في علوم الحاسوب. الفلك في علم الفلك، بنى العلماء المسلمون مراصد فلكية متقدمة ووضعوا جداول فلكية دقيقة. كما صححوا كثيراً من النظريات الإغريقية القديمة. إن إسهامات العلماء المسلمين في العلوم كانت أساساً مهماً للنهضة العلمية الأوروبية لاحقاً.",
    "metadata": {
      "title": "العلوم في الحضارة الإسلامية",
      "html_length": 1344,
      "text_length": 772,
      "source_file": "C:\\Users\\a-ahm\\Desktop\\arqa\\test_html_articles\\arabic_science.html",
      "filename": "arabic_science.html",
      "chunk_id": 0,
      "total_chunks": 1,
      "chunk_length": 122
    }
  },
  {
    "content": "الذكاء الاصطناعي في العصر الحديث الذكاء الاصطناعي في العصر الحديث يشهد مجال الذكاء الاصطناعي تطوراً مستمراً وسريعاً في السنوات الأخيرة. هذا التطور يؤثر على جميع جوانب الحياة من الطب إلى التعليم والنقل. تعلم الآلة تعلم الآلة هو فرع من الذكاء الاصطناعي يمكّن الحاسوب من التعلم بدون برمجة صريحة. يستخدم خوارزميات معقدة لتحليل البيانات واستخراج الأنماط. معالجة اللغة الطبيعية معالجة اللغة الطبيعية تتيح للحاسوب فهم وتحليل اللغة البشرية. هذا يشمل الترجمة الآلية، وتحليل المشاعر، والإجابة على الأسئلة. التطبيقات الحديثة يستخدم الذكاء الاصطناعي اليوم في السيارات ذاتية القيادة، والمساعدات الذكية، وأنظمة التوصية، والتشخيص الطبي. التحديات والأخلاقيات رغم الفوائد العظيمة، يواجه الذكاء الاصطناعي تحديات أخلاقية مثل الخصوصية، والتحيز في الخوارزميات، وتأثيره على سوق العمل.",
    "metadata": {
      "title": "الذكاء الاصطناعي في العصر الحديث",
      "html_length": 1291,
      "text_length": 762,
      "source_file": "C:\\Users\\a-ahm\\Desktop\\arqa\\test_html_articles\\artificial_intelligence.html",
      "filename": "artificial_intelligence.html",
      "chunk_id": 0,
      "total_chunks": 1,
      "chunk_length": 111
    }
  },
  {
    "content": "اختبار بسيط اختبار النظام هذا اختبار بسيط للنظام العربي. النظام يعمل بشكل جيد.",
    "metadata": {
      "title": "اختبار بسيط",
      "html_length": 209,
      "text_length": 78,
      "source_file": "C:\\Users\\a-ahm\\Desktop\\arqa\\test_simple\\test.html",
      "filename": "test.html",
      "chunk_id": 0,
      "total_chunks": 1,
      "chunk_length": 13
    }
  }
]